Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/mental_health/mental_health_act_2001.html.txt.tmx
Source language: en
Languages: ga

source: Mental Health Act 2001
ga: An tAcht Meabhair-Shláinte 2001

source: The Mental Health Act 2001 changed the rules about admission to psychiatric hospitals and the rights of psychiatric patients
ga: D’athraigh An tAcht Meabhair-Shláinte 2001 na rialacha maidir le duine a ghlacadh isteach in ospidéil síciatracha agus cearta othar síciatrach

source: Since the Act was implemented on 1 November 2006, new procedures have been put in place for the monitoring and regulation of standards of care in psychiatric hospitals
ga: Ó tháinig an tAcht i bhfeidhm an 1 Samhain 2006, tá nósanna imeachta nua curtha i bhfeidhm chun monaitóireacht agus rialú a dhéanamh ar na caighdeáin cúraim in ospidéil síciatracha

source: Best interests of the patient
ga: Barr leas an othair

source: When people are admitted or are receiving treatment in approved centres (that is, psychiatric hospitals or inpatient services), their best interests should be considered before any decision about their care and treatment is made
ga: Nuair a ghlactar daoine isteach san ionad ceadaithe nó nuair atá siad ag fáil cóireála in ionad ceadaithe (sé sin, ospidéil shíciatracha nó seirbhísí d’othair chónaitheacha), ní mór a leas a thabhairt san áireamh sula ndéantar aon cinneadh maidir lena gcúram nó a gcóireáil

source: They should be included in discussions with their care team about where their best interests lie to help them with their recovery
ga: Ba chóir iad a thabhairt san áireamh i bpléití lena bhfoirne agus a mbarr leas á bplé agus chun cabhrú leo ina dtéarnamh

source: Patients have the right to be treated with dignity and respect and the right to be listened to by all those working on their care team
ga: Tá sé de cheart ag othair go gcaithfí leo le dínit agus meas agus go n-éisteodh gach duine atá ag obair ar a bhfoireann chúraim leo

source: They are entitled to take part in decisions that affect their health and their care team should consider their views carefully
ga: Tá sé de cheart acu a bheith páirteach i gcinntí a bhfuil tionchar acu ar a sláinte agus ba chóir don fhoireann chúraim a gcuid tuairimí a bhreithniú go cúramach

source: They have the right to be fully informed about their legal rights, their admission and treatment
ga: Tá sé de cheart acu a bheith go hiomlán ar an eolas faoin a gcearta dlí, a nglacadh isteach san ospidéal agus a gcóireáil

source: The Mental Health Commission has been in existence since 2002
ga: Tá an Coimisiún Meabhair-Shláinte ar an bhfód ó 2002

source: Its main functions are:
ga: Seo a leanas na príomhfheidhmeanna atá aige:

source: • To promote, encourage and foster high standards and good practices in the delivery of mental health services and
ga: • Caighdeáin arda agus dea-chleachtais a chur chun cinn, a spreagadh agus a chothú i seachadadh seirbhísí meabhair-shláinte

source: • To protect the interests of people who have been involuntarily admitted to an approved centre
ga: and • Leas na ndaoine a glacadh isteach go neamhdheonach chuig ionad ceadaithe a chosaint

source: It is responsible for implementing the provisions of the Act in relation to involuntary admission, for setting up mental health tribunals and ensuring that the rights of patients are respected
ga: Tá sé freagrach as forálacha an Achta a chur i bhfeidhm maidir le glacadh isteach neamhdheonach , as binsí meabhair-shláinte a shocrú suas agus as a chinntiú go bhfuil meas ar chearta na n-othar

source: It has drawn up the forms necessary for the various processes and issued guidelines for people involved in the mental health system
ga: Tá na foirmeacha a bhfuil gá leo dréachtaithe aige maidir leis na próisis éagsúla agus na treoirlínte eisithe aige do dhaoine a bhfuil baint acu leis an gcóras meabhair-shláinte

source: The Mental Health Commission has published a guide to the Mental Health Act 2001 which is available in English, Irish, Arabic, Chinese, French, Polish and Russian
ga: Tá treoir maidir leis an Acht Meabhair-Shláinte 2001 foilsithe ag an gCoimisiún Meabhair-Shláinte agus í ar fáil i mBéarla, Gaeilge, Araibis, Sínis, Fraincis, Polainnis agus Rúisis
